Classes | Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::RoutingSegmentDefault Class Reference
MEP Element Manager
The RoutingSegmentDefault contains the necessary non-geometric data for creating and modifying a Routing Segment. More...
#include <MEPRoutingSegmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingSegmentDefault:
 Classes
class  | Modifier
Modifier of the RoutingSegmentDefault. More...
 Public Member Functions
RigidSegmentDefault  | GetRigidSegmentDefault () const
double  | GetCrossSectionWidth () const
double  | GetCrossSectionHeight () const
ConnectorShape  | GetCrossSectionShape () const
Result< uint32_t >  | GetCrossSectionReferenceId () const
Domain  | GetDomain () const
UniqueID  | GetPreferenceTableId () const
API_AnchorID  | GetAnchor () const
double  | GetReferenceLineOffsetX () const
double  | GetReferenceLineOffsetY () const
double  | GetWallThickness () const
ConnectionStyle  | GetConnectionStyle () const
std::optional< double >  | GetFlangeSize () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
RoutingSegmentDefault (std::shared_ptr< Impl::IRoutingSegmentDefaultImpl > impl)
Constructs a RoutingSegmentDefault with the given implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Static Protected Member Functions
static Result< RoutingSegmentDefault >  | Create (const API_Token &token, Domain domain)
Creates a RoutingSegmentDefault with the given token and domain.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< RoutingSegmentDefault >  | CreateRoutingSegmentDefault (Domain domain)
Creates a RoutingSegmentDefault.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingSegmentDefault contains the necessary non-geometric data for creating and modifying a Routing Segment.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault RoutingSegmentDefault Modification
 // PickUp RoutingElementDefault from RoutingElement
 RoutingElementDefault routingElementDefault = routingElement.PickUpDefault ();
 // Get RoutingSegmentDefault of RoutingElementDefault and modify it
 RoutingSegmentDefault routingSegmentDefault = routingElementDefault.GetRoutingSegmentDefault ();
 double currentWidth = routingSegmentDefault.GetCrossSectionWidth ();
 double currentHeight = routingSegmentDefault.GetCrossSectionHeight ();
 ACAPI::Result<void> segmentDefaultModifyResult = routingSegmentDefault.Modify ([&](RoutingSegmentDefault::Modifier& modifier) {
 if (routingSegmentDefault.GetCrossSectionShape () == ConnectorShape::Circular) {
 modifier.SetCrossSectionReferenceId (63);
 } else {
 modifier.SetCrossSectionWidth (2.0 * currentWidth);
 modifier.SetCrossSectionHeight (2.0 * currentHeight);
 }
 modifier.SetAnchor (APIAnc_RB); // right bottom
 modifier.SetReferenceLineOffsetX (-0.1);
 modifier.SetReferenceLineOffsetY (0.2);
 });
 if (segmentDefaultModifyResult.IsErr ())
 return segmentDefaultModifyResult.UnwrapErr ().kind;
 // Set RoutingSegmentDefault back to RoutingElementDefault
 ACAPI::Result<void> elementDefaultModifyResult = routingElementDefault.Modify ([&](RoutingElementDefault::Modifier& modifier) {
 modifier.SetRoutingSegmentDefault (routingSegmentDefault);
 });
 if (elementDefaultModifyResult.IsErr ())
 return elementDefaultModifyResult.UnwrapErr ().kind;
 // Inject RoutingElementDefault into RoutingElement
 ACAPI::Result<void> injectResult = routingElement.Modify ([&routingElementDefault](RoutingElement::Modifier& modifier) {
 modifier.Inject (routingElementDefault);
 }, "Inject Default into RoutingElement.");
 if (injectResult.IsErr ())
 return injectResult.UnwrapErr ().kind;
 return NoError;
Constructor & Destructor Documentation
◆ RoutingSegmentDefault()
 ACAPI::MEP::RoutingSegmentDefault::RoutingSegmentDefault  |  ( |  std::shared_ptr< Impl::IRoutingSegmentDefaultImpl > |  impl | )
protected
Constructs a RoutingSegmentDefault with the given implementation.
Parameters
impl | The given implementation.
Member Function Documentation
◆ Create()
 static Result< RoutingSegmentDefault > ACAPI::MEP::RoutingSegmentDefault::Create  |  ( |  const API_Token & |  token,
|  Domain |  domain )
staticprotected
Creates a RoutingSegmentDefault with the given token and domain.
Parameters
token | The given token.
domain | The given domain.
Returns
The result of the creation with the created RoutingSegmentDefault.
◆ GetAnchor()
 API_AnchorID ACAPI::MEP::RoutingSegmentDefault::GetAnchor  |  ( |   | ) |   const
Returns
Returns the anchor position of the RoutingSegmentDefault.
◆ GetConnectionStyle()
 ConnectionStyle ACAPI::MEP::RoutingSegmentDefault::GetConnectionStyle  |  ( |   | ) |   const
Returns
Returns the connection style used by the RigidSegmentDefault's Ports.
◆ GetCrossSectionHeight()
 double ACAPI::MEP::RoutingSegmentDefault::GetCrossSectionHeight  |  ( |   | ) |   const
Returns
Returns the height of the RoutingSegmentDefault.
◆ GetCrossSectionReferenceId()
 Result< uint32_t > ACAPI::MEP::RoutingSegmentDefault::GetCrossSectionReferenceId  |  ( |   | ) |   const
Returns
Returns error if the Cross Section shape is Rectangular, otherwise the referenceId of the Circular Cross Section in the RoutingSegmentDefault.
◆ GetCrossSectionShape()
 ConnectorShape ACAPI::MEP::RoutingSegmentDefault::GetCrossSectionShape  |  ( |   | ) |   const
Returns
Returns the shape of the RoutingSegmentDefault.
◆ GetCrossSectionWidth()
 double ACAPI::MEP::RoutingSegmentDefault::GetCrossSectionWidth  |  ( |   | ) |   const
Returns
Returns the width of the RoutingSegmentDefault.
◆ GetDomain()
 Domain ACAPI::MEP::RoutingSegmentDefault::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the default.
◆ GetFlangeSize()
 std::optional< double > ACAPI::MEP::RoutingSegmentDefault::GetFlangeSize  |  ( |   | ) |   const
Returns
Returns the size of the flange (width for Ventilation, diameter for Piping) if the connection style is Flanged.
◆ GetPreferenceTableId()
 UniqueID ACAPI::MEP::RoutingSegmentDefault::GetPreferenceTableId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable is associated with.
◆ GetReferenceLineOffsetX()
 double ACAPI::MEP::RoutingSegmentDefault::GetReferenceLineOffsetX  |  ( |   | ) |   const
Returns
Returns the offset from the reference line along the X-axis of cross-section's plane
◆ GetReferenceLineOffsetY()
 double ACAPI::MEP::RoutingSegmentDefault::GetReferenceLineOffsetY  |  ( |   | ) |   const
Returns
Returns the offset from the reference line along the Y-axis of cross-section's plane
◆ GetRigidSegmentDefault()
 RigidSegmentDefault ACAPI::MEP::RoutingSegmentDefault::GetRigidSegmentDefault  |  ( |   | ) |   const
Returns
Returns the RigidSegmentDefault of the RoutingSegmentDefault.
◆ GetWallThickness()
 double ACAPI::MEP::RoutingSegmentDefault::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the RoutingSegmentDefault. The RigidSegmentDefault's Port will use this value as well.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modify  |  ( |  ModifierFunc && |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
Friends And Related Symbol Documentation
◆ CreateRoutingSegmentDefault
 Result< RoutingSegmentDefault > CreateRoutingSegmentDefault  |  ( |  Domain |  domain | )
friend
Creates a RoutingSegmentDefault.
Parameters
domain | The Domain of the requested RoutingSegmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the RoutingSegment from the RoutingElement tool for the domain defined by the parameter, otherwise Error.